manmuqingshan/trail-mate/apps/esp32_lvgl/src/esp32_lvgl_idf_app_facade_runtime.cpp
#include "esp32_lvgl_idf_app_facade_runtime.h"

#if defined(ESP_PLATFORM)
#include "app/app_config.h"
#include "app/app_facade_access.h"
#include "app/app_facades.h"
#include "board/BoardBase.h"
#include "chat/infra/contact_store_core.h"
#include "chat/infra/mesh_protocol_utils.h"
#include "chat/infra/meshcore/mc_region_presets.h"
#include "chat/infra/meshtastic/mt_region.h"
#include "chat/infra/node_store_blob_format.h"
#include "chat/infra/node_store_core.h"
#include "chat/infra/store/ram_store.h"
#include "chat/ports/i_contact_blob_store.h"
#include "chat/ports/i_mesh_adapter.h"
#include "chat/ports/i_node_blob_store.h"
#include "chat/usecase/chat_service.h"
#include "chat/usecase/contact_service.h"
#include "esp_log.h"
#include "esp_mac.h"
#include "esp_random.h"
#include "esp_system.h"
#include "esp_timer.h"
#include "mbedtls/chachapoly.h"
#include "mbedtls/sha256.h"
#include "platform/esp/boards/board_runtime.h"
#include "platform/esp/idf_common/bsp_runtime.h"
#include "platform/esp/radio/meshtastic_radio_adapter.h"
#include "platform/ui/gps_runtime.h"
#include "platform/ui/settings_store.h"
#include "platform/ui/team_ui_store_runtime.h"
#include "platform/ui/tracker_runtime.h"
#include "sys/event_bus.h"
#include "team/ports/i_team_crypto.h"
#include "team/ports/i_team_event_sink.h"
#include "team/ports/i_team_runtime.h"
#include "team/ports/i_team_track_source.h"
#include "team/protocol/team_position.h"
#include "team/usecase/team_controller.h"
#include "team/usecase/team_pairing_service.h"
#include "team/usecase/team_service.h"
#include "team/usecase/team_track_sampler.h"
#include "ui/chat_ui_runtime.h"
#include "ui/screens/team/team_page_shell.h"

#include <algorithm>
#include <cmath>
#include <cstdio>
#include <cstring>
#include <ctime>
#include <memory>
#include <string>
#include <vector>
#endif

namespace trailmate::apps::esp32_lvgl::idf_app_facade_runtime
{
namespace
{

#if defined(ESP_PLATFORM)
constexpr const char* kIdfStoreTag = "idf-app-store";
constexpr const char* kIdfConfigTag = "idf-app-cfg";
constexpr const char* kIdfSettingsNs = "idf_app";
constexpr const char* kIdfConfigKey = "app_cfg";
constexpr const char* kIdfNodesNvsKey = "nodes_blob";
constexpr const char* kIdfContactsNvsKey = "contacts";
constexpr const char* kIdfContactsFile = "/contacts.dat";
constexpr const char* kIdfNodesFile = "/nodes.bin";
constexpr size_t kIdfReadChunkBytes = 256;
constexpr uint32_t kIdfAppConfigMagic = 0x50344346UL; // P4CF
constexpr uint16_t kIdfAppConfigVersion = 1;
constexpr uint32_t kIdfNodeStoreFlushIntervalMs = 5000UL;
constexpr size_t kIdfMaxContactBlobBytes =
    chat::contacts::ContactStoreCore::kMaxContacts *
    chat::contacts::ContactStoreCore::kSerializedEntrySize;
constexpr size_t kIdfMaxNodeFileBytes =
    sizeof(chat::contacts::NodeStoreSdHeader) +
    chat::contacts::NodeStoreCore::kMaxNodes *
        chat::contacts::NodeStoreCore::kSerializedEntrySizeV8;
constexpr const char* kIdfTeamTag = "idf-team";
constexpr size_t kTeamAeadTagBytes = 16;
constexpr size_t kTeamAeadKeyBytes = 32;
constexpr size_t kTeamAeadNonceBytes = 12;

struct IdfPersistedAppConfig
{
    uint32_t magic = 0;
    uint16_t version = 0;
    uint16_t payload_size = 0;
    uint32_t checksum = 0;
    app::AppConfig config{};
};

IdfPersistedAppConfig s_config_blob_scratch{};

uint32_t fnv1a32(const void* data, size_t len)
{
    const auto* bytes = static_cast<const uint8_t*>(data);
    uint32_t hash = 2166136261UL;
    for (size_t i = 0; i < len; ++i)
    {
        hash ^= bytes[i];
        hash *= 16777619UL;
    }
    return hash;
}

int8_t clampTxPower(int8_t value)
{
    if (value < app::AppConfig::kTxPowerMinDbm)
    {
        return app::AppConfig::kTxPowerMinDbm;
    }
    if (value > app::AppConfig::kTxPowerMaxDbm)
    {
        return app::AppConfig::kTxPowerMaxDbm;
    }
    return value;
}

bool idfSupportsMeshProtocol(chat::MeshProtocol protocol)
{
    return protocol == chat::MeshProtocol::Meshtastic;
}

void normalizeIdfAppConfig(app::AppConfig& config)
{
    if (!chat::infra::isValidMeshProtocol(config.mesh_protocol) ||
        !idfSupportsMeshProtocol(config.mesh_protocol))
    {
        ESP_LOGW(kIdfConfigTag,
                 "unsupported mesh protocol=%u; falling back to Meshtastic",
                 static_cast<unsigned>(config.mesh_protocol));
        config.mesh_protocol = chat::MeshProtocol::Meshtastic;
    }

    if (chat::meshtastic::findRegion(
            static_cast<meshtastic_Config_LoRaConfig_RegionCode>(
                config.meshtastic_config.region)) == nullptr)
    {
        config.meshtastic_config.region = app::AppConfig::kDefaultRegionCode;
    }

    config.meshtastic_config.tx_power = clampTxPower(config.meshtastic_config.tx_power);
    config.meshcore_config.tx_power = clampTxPower(config.meshcore_config.tx_power);
    config.rnode_config.tx_power = clampTxPower(config.rnode_config.tx_power);
    if (!chat::meshcore::isValidRegionPresetId(
            config.meshcore_config.meshcore_region_preset))
    {
        config.meshcore_config.meshcore_region_preset = 0;
    }
    if (config.gps_interval_ms == 0)
    {
        config.gps_interval_ms = 60000;
    }
    if (config.chat_channel > 1)
    {
        config.chat_channel = 0;
    }
}

bool loadIdfAppConfig(app::AppConfig& out)
{
    std::vector<uint8_t> blob;
    if (!platform::ui::settings_store::get_blob(kIdfSettingsNs, kIdfConfigKey, blob))
    {
        return false;
    }
    if (blob.size() != sizeof(IdfPersistedAppConfig))
    {
        ESP_LOGW(kIdfConfigTag,
                 "load rejected size=%u expected=%u",
                 static_cast<unsigned>(blob.size()),
                 static_cast<unsigned>(sizeof(IdfPersistedAppConfig)));
        return false;
    }

    std::memcpy(&s_config_blob_scratch, blob.data(), sizeof(s_config_blob_scratch));
    if (s_config_blob_scratch.magic != kIdfAppConfigMagic ||
        s_config_blob_scratch.version != kIdfAppConfigVersion ||
        s_config_blob_scratch.payload_size != sizeof(app::AppConfig))
    {
        ESP_LOGW(kIdfConfigTag,
                 "load rejected magic=%08lx version=%u payload=%u",
                 static_cast<unsigned long>(s_config_blob_scratch.magic),
                 static_cast<unsigned>(s_config_blob_scratch.version),
                 static_cast<unsigned>(s_config_blob_scratch.payload_size));
        return false;
    }

    const uint32_t checksum =
        fnv1a32(&s_config_blob_scratch.config, sizeof(s_config_blob_scratch.config));
    if (checksum != s_config_blob_scratch.checksum)
    {
        ESP_LOGW(kIdfConfigTag,
                 "load rejected checksum stored=%08lx actual=%08lx",
                 static_cast<unsigned long>(s_config_blob_scratch.checksum),
                 static_cast<unsigned long>(checksum));
        return false;
    }

    out = s_config_blob_scratch.config;
    normalizeIdfAppConfig(out);
    ESP_LOGI(kIdfConfigTag,
             "loaded app config proto=%u region=%u tx=%d",
             static_cast<unsigned>(out.mesh_protocol),
             static_cast<unsigned>(out.meshtastic_config.region),
             static_cast<int>(out.meshtastic_config.tx_power));
    return true;
}

