manmuqingshan/trail-mate/apps/esp32_lvgl/src/esp32_lvgl_idf_app_facade_runtime.cpp
bool saveIdfAppConfig(const app::AppConfig& config)
{
    s_config_blob_scratch = IdfPersistedAppConfig{};
    s_config_blob_scratch.magic = kIdfAppConfigMagic;
    s_config_blob_scratch.version = kIdfAppConfigVersion;
    s_config_blob_scratch.payload_size = static_cast<uint16_t>(sizeof(app::AppConfig));
    s_config_blob_scratch.config = config;
    s_config_blob_scratch.checksum =
        fnv1a32(&s_config_blob_scratch.config, sizeof(s_config_blob_scratch.config));

    const bool ok = platform::ui::settings_store::put_blob(
        kIdfSettingsNs,
        kIdfConfigKey,
        &s_config_blob_scratch,
        sizeof(s_config_blob_scratch));
    ESP_LOGI(kIdfConfigTag,
             "save app config proto=%u region=%u tx=%d ok=%u",
             static_cast<unsigned>(config.mesh_protocol),
             static_cast<unsigned>(config.meshtastic_config.region),
             static_cast<int>(config.meshtastic_config.tx_power),
             ok ? 1U : 0U);
    return ok;
}

bool loadNvsBlob(const char* key, const char* label, std::vector<uint8_t>& out, size_t max_len)
{
    std::vector<uint8_t> blob;
    if (!platform::ui::settings_store::get_blob(kIdfSettingsNs, key, blob))
    {
        return false;
    }
    if (blob.empty() || blob.size() > max_len)
    {
        ESP_LOGW(kIdfStoreTag,
                 "%s nvs load rejected len=%u max=%u",
                 label,
                 static_cast<unsigned>(blob.size()),
                 static_cast<unsigned>(max_len));
        out.clear();
        return false;
    }
    out = blob;
    ESP_LOGI(kIdfStoreTag,
             "%s load source=nvs key=%s len=%u",
             label,
             key,
             static_cast<unsigned>(out.size()));
    return true;
}

bool saveNvsBlob(const char* key, const char* label, const uint8_t* data, size_t len, size_t max_len)
{
    if (len == 0)
    {
        return platform::ui::settings_store::put_blob(kIdfSettingsNs, key, nullptr, 0);
    }
    if (!data || len > max_len)
    {
        return false;
    }

    const bool ok = platform::ui::settings_store::put_blob(kIdfSettingsNs, key, data, len);
    ESP_LOGI(kIdfStoreTag,
             "%s save target=nvs key=%s len=%u ok=%u",
             label,
             key,
             static_cast<unsigned>(len),
             ok ? 1U : 0U);
    return ok;
}

bool isValidContactBlobSize(size_t len)
{
    return len != 0 &&
           len <= kIdfMaxContactBlobBytes &&
           (len % chat::contacts::ContactStoreCore::kSerializedEntrySize) == 0 &&
           (len / chat::contacts::ContactStoreCore::kSerializedEntrySize) <=
               chat::contacts::ContactStoreCore::kMaxContacts;
}

std::string makeSdPath(const char* relative)
{
    const char* mount = platform::esp::idf_common::bsp_runtime::sdcard_mount_point();
    std::string path = mount ? mount : "";
    if (path.empty() || !relative || !relative[0])
    {
        return path;
    }
    if (path.back() == '/' && relative[0] == '/')
    {
        path.pop_back();
    }
    else if (path.back() != '/' && relative[0] != '/')
    {
        path.push_back('/');
    }
    path += relative;
    return path;
}

bool readSdFile(const char* relative, std::vector<uint8_t>& out, size_t max_len)
{
    out.clear();
    if (!platform::esp::idf_common::bsp_runtime::ensure_sdcard_ready())
    {
        ESP_LOGW(kIdfStoreTag, "load skipped: sd not ready path=%s", relative);
        return false;
    }

    const std::string path = makeSdPath(relative);
    FILE* file = std::fopen(path.c_str(), "rb");
    if (!file)
    {
        return false;
    }

    if (std::fseek(file, 0, SEEK_END) != 0)
    {
        std::fclose(file);
        return false;
    }
    const long size = std::ftell(file);
    if (size <= 0 || static_cast<size_t>(size) > max_len)
    {
        std::fclose(file);
        return false;
    }
    if (std::fseek(file, 0, SEEK_SET) != 0)
    {
        std::fclose(file);
        return false;
    }

    out.reserve(static_cast<size_t>(size));
    uint8_t buffer[kIdfReadChunkBytes];
    size_t total_read = 0;
    while (total_read < static_cast<size_t>(size))
    {
        const size_t chunk = std::min(kIdfReadChunkBytes, static_cast<size_t>(size) - total_read);
        const size_t read = std::fread(buffer, 1, chunk, file);
        if (read != chunk)
        {
            std::fclose(file);
            out.clear();
            return false;
        }
        out.insert(out.end(), buffer, buffer + read);
        total_read += read;
    }
    std::fclose(file);
    return true;
}

bool removeSdFile(const char* relative)
{
    if (!platform::esp::idf_common::bsp_runtime::ensure_sdcard_ready())
    {
        return false;
    }
    const std::string path = makeSdPath(relative);
    const std::string temp_path = path + ".tmp";
    std::remove(temp_path.c_str());
    std::remove(path.c_str());
    return true;
}

bool writeSdFileAtomic(const char* relative, const uint8_t* data, size_t len)
{
    if (len == 0)
    {
        return removeSdFile(relative);
    }
    if (!data)
    {
        return false;
    }
    if (!platform::esp::idf_common::bsp_runtime::ensure_sdcard_ready())
    {
        ESP_LOGW(kIdfStoreTag, "save skipped: sd not ready path=%s len=%u",
                 relative,
                 static_cast<unsigned>(len));
        return false;
    }

    const std::string path = makeSdPath(relative);
    const std::string temp_path = path + ".tmp";
    std::remove(temp_path.c_str());

    FILE* file = std::fopen(temp_path.c_str(), "wb");
    if (!file)
    {
        ESP_LOGW(kIdfStoreTag, "save open failed path=%s", temp_path.c_str());
        return false;
    }

    const size_t written = std::fwrite(data, 1, len, file);
    const int close_result = std::fclose(file);
    if (written != len || close_result != 0)
    {
        std::remove(temp_path.c_str());
        ESP_LOGW(kIdfStoreTag, "save write failed path=%s want=%u got=%u close=%d",
                 temp_path.c_str(),
                 static_cast<unsigned>(len),
                 static_cast<unsigned>(written),
                 close_result);
        return false;
    }

