manmuqingshan/trail-mate/apps/esp32_lvgl/src/esp32_lvgl_idf_app_facade_runtime.cpp
    std::remove(path.c_str());
    if (std::rename(temp_path.c_str(), path.c_str()) != 0)
    {
        std::remove(temp_path.c_str());
        ESP_LOGW(kIdfStoreTag, "save rename failed tmp=%s path=%s",
                 temp_path.c_str(),
                 path.c_str());
        return false;
    }
    return true;
}

class IdfSdNodeBlobStore final : public chat::contacts::INodeBlobStore
{
  public:
    bool loadBlob(std::vector<uint8_t>& out) override
    {
        std::vector<uint8_t> file;
        if (!readSdFile(kIdfNodesFile, file, kIdfMaxNodeFileBytes) ||
            file.size() <= sizeof(chat::contacts::NodeStoreSdHeader))
        {
            return loadBlobFromNvs(out);
        }

        chat::contacts::NodeStoreSdHeader header{};
        std::memcpy(&header, file.data(), sizeof(header));
        const uint8_t* payload = file.data() + sizeof(header);
        const size_t payload_len = file.size() - sizeof(header);
        if (chat::contacts::validateNodeStoreSdBlob(header, payload, payload_len) !=
            chat::contacts::NodeBlobValidation::Ok)
        {
            out.clear();
            ESP_LOGW(kIdfStoreTag,
                     "node load invalid path=%s ver=%u count=%u len=%u",
                     kIdfNodesFile,
                     static_cast<unsigned>(header.ver),
                     static_cast<unsigned>(header.count),
                     static_cast<unsigned>(payload_len));
            return loadBlobFromNvs(out);
        }

        std::vector<chat::contacts::NodeEntry> entries;
        if (!chat::contacts::NodeStoreCore::decodeBlob(entries, payload, payload_len, header.ver))
        {
            out.clear();
            ESP_LOGW(kIdfStoreTag, "node load decode failed path=%s ver=%u",
                     kIdfNodesFile,
                     static_cast<unsigned>(header.ver));
            return loadBlobFromNvs(out);
        }

        chat::contacts::NodeStoreCore::encodeBlob(out, entries);
        ESP_LOGI(kIdfStoreTag,
                 "node load source=sd path=%s count=%u len=%u",
                 kIdfNodesFile,
                 static_cast<unsigned>(entries.size()),
                 static_cast<unsigned>(out.size()));
        return !out.empty();
    }

    bool saveBlob(const uint8_t* data, size_t len) override
    {
        if (len == 0)
        {
            (void)removeSdFile(kIdfNodesFile);
            (void)saveNvsBlob(kIdfNodesNvsKey, "node", nullptr, 0, kIdfMaxNodeFileBytes);
            return true;
        }
        if (!chat::contacts::isValidNodeBlobSize(len) ||
            chat::contacts::nodeBlobEntryCount(len) > chat::contacts::NodeStoreCore::kMaxNodes)
        {
            return false;
        }

        chat::contacts::NodeStoreSdHeader header =
            chat::contacts::makeNodeStoreSdHeader(data, len);
        std::vector<uint8_t> file(sizeof(header) + len);
        std::memcpy(file.data(), &header, sizeof(header));
        std::memcpy(file.data() + sizeof(header), data, len);
        const bool sd_ok = writeSdFileAtomic(kIdfNodesFile, file.data(), file.size());
        const bool nvs_ok =
            saveNvsBlob(kIdfNodesNvsKey, "node", data, len, kIdfMaxNodeFileBytes);
        ESP_LOGI(kIdfStoreTag,
                 "node save path=%s count=%u len=%u sd=%u nvs=%u",
                 kIdfNodesFile,
                 static_cast<unsigned>(header.count),
                 static_cast<unsigned>(len),
                 sd_ok ? 1U : 0U,
                 nvs_ok ? 1U : 0U);
        return sd_ok || nvs_ok;
    }

    void clearBlob() override
    {
        (void)removeSdFile(kIdfNodesFile);
        (void)saveNvsBlob(kIdfNodesNvsKey, "node", nullptr, 0, kIdfMaxNodeFileBytes);
    }

  private:
    bool loadBlobFromNvs(std::vector<uint8_t>& out)
    {
        if (!loadNvsBlob(kIdfNodesNvsKey, "node", out, kIdfMaxNodeFileBytes))
        {
            out.clear();
            return false;
        }
        if (!chat::contacts::isValidNodeBlobSize(out.size()) ||
            chat::contacts::nodeBlobEntryCount(out.size()) >
                chat::contacts::NodeStoreCore::kMaxNodes)
        {
            ESP_LOGW(kIdfStoreTag,
                     "node nvs load invalid len=%u",
                     static_cast<unsigned>(out.size()));
            out.clear();
            return false;
        }

        std::vector<chat::contacts::NodeEntry> entries;
        if (!chat::contacts::NodeStoreCore::decodeBlob(entries, out.data(), out.size()))
        {
            ESP_LOGW(kIdfStoreTag,
                     "node nvs decode failed len=%u",
                     static_cast<unsigned>(out.size()));
            out.clear();
            return false;
        }

        chat::contacts::NodeStoreCore::encodeBlob(out, entries);
        ESP_LOGI(kIdfStoreTag,
                 "node load source=nvs count=%u len=%u",
                 static_cast<unsigned>(entries.size()),
                 static_cast<unsigned>(out.size()));
        return !out.empty();
    }
};

class IdfSdContactBlobStore final : public chat::IContactBlobStore
{
  public:
    bool loadBlob(std::vector<uint8_t>& out) override
    {
        const bool ok = readSdFile(kIdfContactsFile, out, kIdfMaxContactBlobBytes);
        if (ok)
        {
            ESP_LOGI(kIdfStoreTag,
                     "contacts load source=sd path=%s len=%u",
                     kIdfContactsFile,
                     static_cast<unsigned>(out.size()));
            if (isValidContactBlobSize(out.size()))
            {
                return true;
            }
            ESP_LOGW(kIdfStoreTag,
                     "contacts sd load invalid len=%u",
                     static_cast<unsigned>(out.size()));
            out.clear();
        }

        if (!loadNvsBlob(kIdfContactsNvsKey, "contacts", out, kIdfMaxContactBlobBytes))
        {
            out.clear();
            return false;
        }
        if (!isValidContactBlobSize(out.size()))
        {
            ESP_LOGW(kIdfStoreTag,
                     "contacts nvs load invalid len=%u",
                     static_cast<unsigned>(out.size()));
            out.clear();
            return false;
        }
        return true;
    }

    bool saveBlob(const uint8_t* data, size_t len) override
    {
        if (len == 0)
        {
            (void)removeSdFile(kIdfContactsFile);
            (void)saveNvsBlob(kIdfContactsNvsKey, "contacts", nullptr, 0, kIdfMaxContactBlobBytes);
            return true;
        }
        if (!isValidContactBlobSize(len))
        {
            return false;
        }

        const bool sd_ok = writeSdFileAtomic(kIdfContactsFile, data, len);
        const bool nvs_ok =
            saveNvsBlob(kIdfContactsNvsKey, "contacts", data, len, kIdfMaxContactBlobBytes);
        ESP_LOGI(kIdfStoreTag,
                 "contacts save path=%s len=%u sd=%u nvs=%u",
                 kIdfContactsFile,
                 static_cast<unsigned>(len),
                 sd_ok ? 1U : 0U,
                 nvs_ok ? 1U : 0U);
        return sd_ok || nvs_ok;
    }
};

class IdfNullMeshAdapter final : public chat::IMeshAdapter
{
  public:
    bool sendText(chat::ChannelId channel,
                  const std::string& text,
                  chat::MessageId* out_msg_id,
                  chat::NodeId peer = 0) override
    {
        (void)channel;
        (void)text;
        (void)peer;
        if (out_msg_id)
        {
            *out_msg_id = 0;
        }
        return false;
    }

    chat::MeshSendResult sendTextDetailed(chat::ChannelId channel,
                                          const std::string& text,
                                          chat::MessageId forced_msg_id = 0,
                                          chat::NodeId peer = 0) override
    {
        (void)channel;
        (void)text;
        (void)peer;
        const chat::MessageId msg_id = forced_msg_id != 0 ? forced_msg_id : next_msg_id_++;
        return chat::MeshSendResult::fail(chat::MeshOperationFailure::NotReady, msg_id);
    }

