manmuqingshan/trail-mate/apps/esp32_lvgl/src/esp32_lvgl_idf_app_facade_runtime.cpp
    bool pollIncomingText(chat::MeshIncomingText* out) override
    {
        (void)out;
        return false;
    }

    bool sendAppData(chat::ChannelId channel,
                     uint32_t portnum,
                     const uint8_t* payload,
                     size_t len,
                     chat::NodeId dest = 0,
                     bool want_ack = false,
                     chat::MessageId packet_id = 0,
                     bool want_response = false) override
    {
        (void)channel;
        (void)portnum;
        (void)payload;
        (void)len;
        (void)dest;
        (void)want_ack;
        (void)packet_id;
        (void)want_response;
        return false;
    }

    bool pollIncomingData(chat::MeshIncomingData* out) override
    {
        (void)out;
        return false;
    }

    chat::NodeId getNodeId() const override
    {
        return self_node_id_;
    }

    void applyConfig(const chat::MeshConfig& config) override
    {
        active_config_ = config;
    }

    void setUserInfo(const char* long_name, const char* short_name) override
    {
        copyString(long_name_, sizeof(long_name_), long_name);
        copyString(short_name_, sizeof(short_name_), short_name);
    }

    void setNetworkLimits(bool duty_cycle_enabled, uint8_t util_percent) override
    {
        duty_cycle_enabled_ = duty_cycle_enabled;
        util_percent_ = util_percent;
    }

    void setPrivacyConfig(uint8_t encrypt_mode) override
    {
        encrypt_mode_ = encrypt_mode;
    }

    bool isReady() const override
    {
        return false;
    }

    bool pollIncomingRawPacket(uint8_t* out_data, size_t& out_len, size_t max_len) override
    {
        (void)out_data;
        (void)max_len;
        out_len = 0;
        return false;
    }

    void setSelfNodeId(chat::NodeId node_id)
    {
        self_node_id_ = node_id;
    }

  private:
    static void copyString(char* dst, size_t dst_len, const char* src)
    {
        if (!dst || dst_len == 0)
        {
            return;
        }
        if (!src)
        {
            dst[0] = '\0';
            return;
        }
        std::strncpy(dst, src, dst_len - 1);
        dst[dst_len - 1] = '\0';
    }

    chat::MessageId next_msg_id_ = 1;
    chat::NodeId self_node_id_ = 0;
    chat::MeshConfig active_config_{};
    char long_name_[32] = {};
    char short_name_[16] = {};
    bool duty_cycle_enabled_ = true;
    uint8_t util_percent_ = 0;
    uint8_t encrypt_mode_ = 1;
};

class IdfTeamRuntime final : public team::ITeamRuntime
{
  public:
    uint32_t nowMillis() override
    {
        return static_cast<uint32_t>(esp_timer_get_time() / 1000ULL);
    }

    uint32_t nowUnixSeconds() override
    {
        const std::time_t now = std::time(nullptr);
        if (now > 0)
        {
            return static_cast<uint32_t>(now);
        }
        return nowMillis() / 1000U;
    }

    void fillRandomBytes(uint8_t* out, size_t len) override
    {
        if (out == nullptr || len == 0)
        {
            return;
        }
        esp_fill_random(out, len);
    }
};

class IdfTeamCrypto final : public team::ITeamCrypto
{
  public:
    bool deriveKey(const uint8_t* key,
                   size_t key_len,
                   const char* info,
                   uint8_t* out,
                   size_t out_len) override
    {
        if (key == nullptr || info == nullptr || out == nullptr || out_len > 32)
        {
            return false;
        }

        uint8_t digest[32] = {};
        mbedtls_sha256_context ctx;
        mbedtls_sha256_init(&ctx);
        const bool ok = mbedtls_sha256_starts(&ctx, 0) == 0 &&
                        mbedtls_sha256_update(&ctx, key, key_len) == 0 &&
                        mbedtls_sha256_update(
                            &ctx,
                            reinterpret_cast<const unsigned char*>(info),
                            std::strlen(info)) == 0 &&
                        mbedtls_sha256_finish(&ctx, digest) == 0;
        mbedtls_sha256_free(&ctx);
        if (!ok)
        {
            return false;
        }
        std::memcpy(out, digest, out_len);
        return true;
    }

    bool aeadEncrypt(const uint8_t* key,
                     size_t key_len,
                     const uint8_t* nonce,
                     size_t nonce_len,
                     const uint8_t* aad,
                     size_t aad_len,
                     const uint8_t* plain,
                     size_t plain_len,
                     std::vector<uint8_t>& out_cipher) override
    {
        if (!validAeadInput(key, key_len, nonce, nonce_len, plain, plain_len))
        {
            return false;
        }

        out_cipher.assign(plain_len + kTeamAeadTagBytes, 0);
        mbedtls_chachapoly_context ctx;
        mbedtls_chachapoly_init(&ctx);
        const bool ok =
            mbedtls_chachapoly_setkey(&ctx, key) == 0 &&
            mbedtls_chachapoly_encrypt_and_tag(
                &ctx,
                plain_len,
                nonce,
                aad_len > 0 ? aad : nullptr,
                aad_len,
                plain_len > 0 ? plain : nullptr,
                plain_len > 0 ? out_cipher.data() : nullptr,
                out_cipher.data() + plain_len) == 0;
        mbedtls_chachapoly_free(&ctx);
        if (!ok)
        {
            out_cipher.clear();
            return false;
        }
        return true;
    }

    bool aeadDecrypt(const uint8_t* key,
                     size_t key_len,
                     const uint8_t* nonce,
                     size_t nonce_len,
                     const uint8_t* aad,
                     size_t aad_len,
                     const uint8_t* cipher,
                     size_t cipher_len,
                     std::vector<uint8_t>& out_plain) override
    {
        if (!validAeadInput(key, key_len, nonce, nonce_len, cipher, cipher_len) ||
            cipher_len < kTeamAeadTagBytes)
        {
            return false;
        }

        const size_t plain_len = cipher_len - kTeamAeadTagBytes;
        out_plain.assign(plain_len, 0);
        mbedtls_chachapoly_context ctx;
        mbedtls_chachapoly_init(&ctx);
        const bool ok =
            mbedtls_chachapoly_setkey(&ctx, key) == 0 &&
            mbedtls_chachapoly_auth_decrypt(
                &ctx,
                plain_len,
                nonce,
                aad_len > 0 ? aad : nullptr,
                aad_len,
                cipher + plain_len,
                plain_len > 0 ? cipher : nullptr,
                plain_len > 0 ? out_plain.data() : nullptr) == 0;
        mbedtls_chachapoly_free(&ctx);
        if (!ok)
        {
            out_plain.clear();
            return false;
        }
        return true;
    }

