manmuqingshan/trail-mate/apps/esp32_lvgl/src/esp32_lvgl_idf_app_facade_runtime.cpp
  private:
    static bool validAeadInput(const uint8_t* key,
                               size_t key_len,
                               const uint8_t* nonce,
                               size_t nonce_len,
                               const uint8_t* payload,
                               size_t payload_len)
    {
        return key != nullptr &&
               key_len == kTeamAeadKeyBytes &&
               nonce != nullptr &&
               nonce_len == kTeamAeadNonceBytes &&
               (payload != nullptr || payload_len == 0);
    }

};

class IdfTeamTrackSourceGps final : public team::ITeamTrackSource
{
  public:
    bool readTrackPoint(team::proto::TeamTrackPoint* out_point) override
    {
        if (out_point == nullptr)
        {
            return false;
        }

        const platform::ui::gps::GpsState state = platform::ui::gps::get_data();
        if (!state.valid)
        {
            out_point->lat_e7 = 0;
            out_point->lon_e7 = 0;
            return false;
        }

        out_point->lat_e7 = static_cast<int32_t>(std::lround(state.lat * 10000000.0));
        out_point->lon_e7 = static_cast<int32_t>(std::lround(state.lng * 10000000.0));
        return true;
    }
};

class IdfTeamAppDataEventBusBridge final
    : public team::TeamService::UnhandledAppDataObserver
{
  public:
    void onUnhandledAppData(const chat::MeshIncomingData& msg) override
    {
        sys::EventBus::publish(
            new sys::AppDataEvent(
                msg.portnum,
                msg.from,
                msg.to,
                msg.packet_id,
                static_cast<uint8_t>(msg.channel),
                msg.channel_hash,
                msg.want_response,
                msg.payload,
                &msg.rx_meta),
            0);
    }
};

class IdfTeamEventBusSink final : public team::ITeamEventSink
{
  public:
    void onTeamKick(const team::TeamKickEvent& event) override
    {
        sys::EventBus::publish(new sys::TeamKickEvent(event), 0);
    }

    void onTeamTransferLeader(const team::TeamTransferLeaderEvent& event) override
    {
        sys::EventBus::publish(new sys::TeamTransferLeaderEvent(event), 0);
    }

    void onTeamKeyDist(const team::TeamKeyDistEvent& event) override
    {
        sys::EventBus::publish(new sys::TeamKeyDistEvent(event), 0);
    }

    void onTeamKeyRequest(const team::TeamKeyRequestEvent& event) override
    {
        sys::EventBus::publish(new sys::TeamKeyRequestEvent(event), 0);
    }

    void onTeamStatus(const team::TeamStatusEvent& event) override
    {
        sys::EventBus::publish(new sys::TeamStatusEvent(event), 0);
    }

    void onTeamPosition(const team::TeamPositionEvent& event) override
    {
        team::proto::TeamPositionMessage msg;
        if (event.ctx.from != 0 &&
            team::proto::decodeTeamPositionMessage(event.payload.data(),
                                                   event.payload.size(),
                                                   &msg))
        {
            const uint32_t timestamp = (msg.ts != 0) ? msg.ts : event.ctx.timestamp;
            sys::EventBus::publish(
                new sys::NodePositionUpdateEvent(
                    event.ctx.from,
                    msg.lat_e7,
                    msg.lon_e7,
                    team::proto::teamPositionHasAltitude(msg),
                    team::proto::teamPositionHasAltitude(msg) ? msg.alt_m : 0,
                    timestamp,
                    0,
                    0,
                    0,
                    0,
                    0),
                0);
        }

        sys::EventBus::publish(new sys::TeamPositionEvent(event), 0);
    }

    void onTeamWaypoint(const team::TeamWaypointEvent& event) override
    {
        sys::EventBus::publish(new sys::TeamWaypointEvent(event), 0);
    }

    void onTeamTrack(const team::TeamTrackEvent& event) override
    {
        sys::EventBus::publish(new sys::TeamTrackEvent(event), 0);
    }

    void onTeamChat(const team::TeamChatEvent& event) override
    {
        sys::EventBus::publish(new sys::TeamChatEvent(event), 0);
    }

    void onTeamError(const team::TeamErrorEvent& event) override
    {
        sys::EventBus::publish(new sys::TeamErrorEvent(event), 0);
    }
};

class IdfAppFacadeRuntime final : public app::IAppFacade
{
  public:
    bool begin(BoardBase& board, LoraBoard* lora_board)
    {
        if (initialized_)
        {
            return true;
        }

        board_ = &board;
        lora_board_ = lora_board;
        if (!loadIdfAppConfig(config_))
        {
            config_ = app::AppConfig{};
            normalizeIdfAppConfig(config_);
            ESP_LOGI(kIdfConfigTag, "using default app config");
        }

        if (!sys::EventBus::init())
        {
            return false;
        }

        const auto identity = platform::esp::boards::defaultIdentity();
        if (config_.node_name[0] == '\0')
        {
            copyString(config_.node_name, sizeof(config_.node_name), identity.long_name);
        }
        if (config_.short_name[0] == '\0')
        {
            copyString(config_.short_name, sizeof(config_.short_name), identity.short_name);
        }

        installMeshAdapter();
        applyMeshConfig();
        applyUserInfo();
        applyNetworkLimits();
        applyPrivacyConfig();

        node_store_.setProtectedNodeChecker(
            [this](uint32_t node_id)
            {
                return !contact_store_.getNickname(node_id).empty();
            });
        node_store_.setAutoSaveEnabled(false);
        contact_service_.begin();
        chat_service_.reset(new chat::ChatService(chat_model_, meshAdapter(), chat_store_));
        chat_service_->setActiveProtocol(config_.mesh_protocol);
        chat_service_->switchChannel(config_.chat_channel == 1 ? chat::ChannelId::SECONDARY
                                                               : chat::ChannelId::PRIMARY);
        initTeamServices();
        restoreTeamKeysFromSnapshot();
        setTeamModeActive(team_service_ && team_service_->hasKeys());
        initialized_ = true;
        return true;
    }

    app::AppConfig& getConfig() override { return config_; }
    const app::AppConfig& getConfig() const override { return config_; }

