manmuqingshan/trail-mate/apps/esp32_lvgl/src/esp32_lvgl_idf_app_facade_runtime.cpp
    void saveConfig() override
    {
        normalizeIdfAppConfig(config_);
        if (chat_service_)
        {
            chat_service_->setActiveProtocol(config_.mesh_protocol);
        }
        (void)saveIdfAppConfig(config_);
    }

    void applyMeshConfig() override
    {
        normalizeIdfAppConfig(config_);
        meshAdapter().applyConfig(config_.activeMeshConfig());
        if (board_)
        {
            board_->applyRadioConfig(config_.mesh_protocol, config_.activeMeshConfig());
        }
    }

    void applyUserInfo() override
    {
        char long_name[sizeof(config_.node_name)] = {};
        char short_name[sizeof(config_.short_name)] = {};
        getEffectiveUserInfo(long_name, sizeof(long_name), short_name, sizeof(short_name));
        meshAdapter().setUserInfo(long_name, short_name);
    }

    void applyPositionConfig() override {}

    void applyNetworkLimits() override
    {
        meshAdapter().setNetworkLimits(config_.net_duty_cycle, config_.net_channel_util);
    }

    void applyPrivacyConfig() override
    {
        meshAdapter().setPrivacyConfig(config_.privacy_encrypt_mode);
    }

    void applyChatDefaults() override
    {
        if (chat_service_)
        {
            chat_service_->switchChannel(config_.chat_channel == 1 ? chat::ChannelId::SECONDARY
                                                                   : chat::ChannelId::PRIMARY);
        }
    }

    chat::MeshProtocol getMeshProtocol() const override
    {
        return config_.mesh_protocol;
    }

    void getEffectiveUserInfo(char* out_long,
                              std::size_t long_len,
                              char* out_short,
                              std::size_t short_len) const override
    {
        const auto identity = platform::esp::boards::defaultIdentity();
        copyString(out_long,
                   long_len,
                   config_.node_name[0] != '\0' ? config_.node_name : identity.long_name);
        copyString(out_short,
                   short_len,
                   config_.short_name[0] != '\0' ? config_.short_name : identity.short_name);
    }

    bool switchMeshProtocol(chat::MeshProtocol protocol, bool persist = true) override
    {
        if (!chat::infra::isValidMeshProtocol(protocol) ||
            !idfSupportsMeshProtocol(protocol))
        {
            ESP_LOGW(kIdfConfigTag,
                     "reject mesh protocol switch proto=%u",
                     static_cast<unsigned>(protocol));
            return false;
        }

        config_.mesh_protocol = protocol;
        if (chat_service_)
        {
            chat_service_->setActiveProtocol(protocol);
        }
        applyMeshConfig();
        if (persist)
        {
            saveConfig();
        }
        return true;
    }

    chat::ChatService& getChatService() override { return *chat_service_; }
    chat::contacts::ContactService& getContactService() override { return contact_service_; }
    chat::IMeshAdapter* getMeshAdapter() override { return &meshAdapter(); }
    const chat::IMeshAdapter* getMeshAdapter() const override { return &meshAdapter(); }
    chat::NodeId getSelfNodeId() const override { return meshAdapter().getNodeId(); }

    team::TeamController* getTeamController() override { return team_controller_.get(); }
    team::TeamPairingService* getTeamPairing() override { return team_pairing_service_.get(); }
    team::TeamService* getTeamService() override { return team_service_.get(); }
    const team::TeamService* getTeamService() const override { return team_service_.get(); }
    team::TeamTrackSampler* getTeamTrackSampler() override { return team_track_sampler_.get(); }
    void setTeamModeActive(bool active) override { team_mode_active_ = active; }

    void broadcastNodeInfo() override
    {
        (void)meshAdapter().triggerDiscoveryAction(chat::MeshDiscoveryAction::SendIdBroadcast);
    }

    void clearNodeDb() override
    {
        node_store_.clear();
        node_blob_store_.clearBlob();
    }

    void clearMessageDb() override
    {
        if (chat_service_)
        {
            chat_service_->clearAllMessages();
        }
    }

    ble::BleManager* getBleManager() override { return nullptr; }
    const ble::BleManager* getBleManager() const override { return nullptr; }
    bool isBleEnabled() const override { return config_.ble_enabled; }
    void setBleEnabled(bool enabled) override { config_.ble_enabled = enabled; }

    void restartDevice() override
    {
        esp_restart();
    }

    chat::ui::IChatUiRuntime* getChatUiRuntime() override
    {
        return chat_ui_runtime_;
    }

    void setChatUiRuntime(chat::ui::IChatUiRuntime* runtime) override
    {
        chat_ui_runtime_ = runtime;
    }

    BoardBase* getBoard() override { return board_; }
    const BoardBase* getBoard() const override { return board_; }

    void updateCoreServices() override
    {
        meshAdapter().processSendQueue();
        platform::ui::tracker::poll();
        chat_service_->processIncoming();
        chat_service_->flushStore();
        flushNodeStoreIfDue();
        if (team_service_)
        {
            team_service_->processIncoming();
        }
        if (team_pairing_service_)
        {
            team_pairing_service_->update();
        }

        const bool team_active = team_service_ && team_service_->hasKeys();
        setTeamModeActive(team_active);
        if (team_track_sampler_)
        {
            team_track_sampler_->update(team_controller_.get(), team_active);
        }
    }

    void tickEventRuntime() override
    {
        chat::ui::IChatUiRuntime* runtime = getChatUiRuntime();
        if (runtime != nullptr)
        {
            runtime->update();
        }
    }

    void dispatchPendingEvents(std::size_t max_events = 32) override
    {
        sys::Event* event = nullptr;
        for (std::size_t processed = 0;
             processed < max_events && sys::EventBus::subscribe(&event, 0);)
        {
            if (event == nullptr)
            {
                continue;
            }
            ++processed;

            if (dispatchRuntimeEvent(event))
            {
                continue;
            }

            if (dispatchTeamUiEvent(event))
            {
                continue;
            }

            chat::ui::IChatUiRuntime* runtime = getChatUiRuntime();
            if (runtime != nullptr)
            {
                runtime->onChatEvent(event);
                continue;
            }

