manmuqingshan/trail-mate/apps/esp32_lvgl/src/esp32_lvgl_idf_app_facade_runtime.cpp
            delete event;
        }
    }

    bool initialized() const { return initialized_; }

  private:
    static void copyString(char* dst, size_t dst_len, const char* src)
    {
        if (!dst || dst_len == 0)
        {
            return;
        }
        if (!src)
        {
            dst[0] = '\0';
            return;
        }
        std::strncpy(dst, src, dst_len - 1);
        dst[dst_len - 1] = '\0';
    }

    static chat::NodeId resolveSelfNodeId()
    {
        uint8_t mac[6] = {};
        if (esp_efuse_mac_get_default(mac) == ESP_OK)
        {
            return (static_cast<chat::NodeId>(mac[2]) << 24) |
                   (static_cast<chat::NodeId>(mac[3]) << 16) |
                   (static_cast<chat::NodeId>(mac[4]) << 8) |
                   static_cast<chat::NodeId>(mac[5]);
        }
        return 0x544D5034UL; // "TMP4"
    }

    void initTeamServices()
    {
        team_crypto_.reset(new IdfTeamCrypto());
        team_event_sink_.reset(new IdfTeamEventBusSink());
        team_app_data_bridge_.reset(new IdfTeamAppDataEventBusBridge());
        team_runtime_.reset(new IdfTeamRuntime());
        team_track_source_.reset(new IdfTeamTrackSourceGps());

        if (!team_crypto_ ||
            !team_event_sink_ ||
            !team_app_data_bridge_ ||
            !team_runtime_ ||
            !team_track_source_)
        {
            ESP_LOGW(kIdfTeamTag, "team service dependencies unavailable");
            return;
        }

        team_service_.reset(
            new team::TeamService(
                *team_crypto_,
                meshAdapter(),
                *team_event_sink_,
                *team_runtime_));
        if (team_service_)
        {
            team_service_->setUnhandledAppDataObserver(team_app_data_bridge_.get());
        }
        team_controller_.reset(new team::TeamController(*team_service_));
        team_track_sampler_.reset(
            new team::TeamTrackSampler(*team_runtime_, *team_track_source_));
    }

    void restoreTeamKeysFromSnapshot()
    {
        if (!team_controller_)
        {
            return;
        }

        team::ui::TeamUiSnapshot snapshot{};
        if (!team::ui::team_ui_snapshot_store().load(snapshot) ||
            !snapshot.has_team_id ||
            !snapshot.has_team_psk ||
            snapshot.security_round == 0)
        {
            return;
        }

        if (team_controller_->setKeysFromPsk(snapshot.team_id,
                                            snapshot.security_round,
                                            snapshot.team_psk.data(),
                                            snapshot.team_psk.size()))
        {
            ESP_LOGI(kIdfTeamTag,
                     "keys restored from Team UI store key_id=%lu",
                     static_cast<unsigned long>(snapshot.security_round));
        }
        else
        {
            ESP_LOGW(kIdfTeamTag,
                     "keys restore failed key_id=%lu",
                     static_cast<unsigned long>(snapshot.security_round));
        }
    }

    void installMeshAdapter()
    {
        null_mesh_adapter_.setSelfNodeId(resolveSelfNodeId());
        mesh_adapter_ = &null_mesh_adapter_;

        if (lora_board_ != nullptr)
        {
            radio_mesh_adapter_.reset(new platform::esp::radio::MeshtasticRadioAdapter(*lora_board_));
            mesh_adapter_ = radio_mesh_adapter_.get();
        }
    }

    chat::IMeshAdapter& meshAdapter()
    {
        return mesh_adapter_ != nullptr ? *mesh_adapter_ : null_mesh_adapter_;
    }

    const chat::IMeshAdapter& meshAdapter() const
    {
        if (mesh_adapter_ != nullptr)
        {
            return *mesh_adapter_;
        }
        return null_mesh_adapter_;
    }

    void flushNodeStoreIfDue()
    {
        const uint32_t now_ms = static_cast<uint32_t>(esp_timer_get_time() / 1000ULL);
        if ((now_ms - last_node_store_flush_ms_) < kIdfNodeStoreFlushIntervalMs)
        {
            return;
        }
        last_node_store_flush_ms_ = now_ms;
        if (!node_store_.flush())
        {
            ESP_LOGW(kIdfStoreTag, "node flush failed");
        }
    }

    static bool isTeamRuntimeEvent(sys::EventType type)
    {
        return type == sys::EventType::TeamKick ||
               type == sys::EventType::TeamTransferLeader ||
               type == sys::EventType::TeamKeyDist ||
               type == sys::EventType::TeamKeyRequest ||
               type == sys::EventType::TeamStatus ||
               type == sys::EventType::TeamPosition ||
               type == sys::EventType::TeamWaypoint ||
               type == sys::EventType::TeamTrack ||
               type == sys::EventType::TeamChat ||
               type == sys::EventType::TeamPairing ||
               type == sys::EventType::TeamError;
    }

    bool dispatchTeamUiEvent(sys::Event* event)
    {
        if (event == nullptr)
        {
            return true;
        }
        if (!isTeamRuntimeEvent(event->type) &&
            event->type != sys::EventType::SystemTick)
        {
            return false;
        }

        team::ui::shell::handle_event(nullptr, event);
        delete event;
        return true;
    }

    bool dispatchRuntimeEvent(sys::Event* event)
    {
        if (event == nullptr)
        {
            return true;
        }

        switch (event->type)
        {
        case sys::EventType::ChatSendResult:
        {
            auto* result_event = static_cast<sys::ChatSendResultEvent*>(event);
            chat_service_->handleSendResult(result_event->msg_id, result_event->success);
            return false;
        }
        case sys::EventType::NodeInfoUpdate:
        {
            auto* node_event = static_cast<sys::NodeInfoUpdateEvent*>(event);
            chat::contacts::NodeUpdate update{};
            update.short_name = node_event->short_name;
            update.long_name = node_event->long_name;
            update.has_last_seen = true;
            update.last_seen = node_event->timestamp;
            update.has_snr = true;
            update.snr = node_event->snr;
            update.has_rssi = true;
            update.rssi = node_event->rssi;
            update.has_protocol = true;
            update.protocol = node_event->protocol;
            update.has_role = true;
            update.role = node_event->role;
            update.has_hops_away = true;
            update.hops_away = node_event->hops_away;
            update.has_hw_model = true;
            update.hw_model = node_event->hw_model;
            update.has_channel = true;
            update.channel = node_event->channel;
            update.has_macaddr = node_event->has_macaddr;
            if (node_event->has_macaddr)
            {
                std::memcpy(update.macaddr, node_event->macaddr, sizeof(update.macaddr));
            }
            update.has_via_mqtt = true;
            update.via_mqtt = node_event->via_mqtt;
            update.has_is_ignored = true;
            update.is_ignored = node_event->is_ignored;
            update.has_public_key = node_event->has_public_key_state;
            update.public_key_present = node_event->has_public_key;
            update.has_key_manually_verified = node_event->has_key_manually_verified_state;
            update.key_manually_verified = node_event->key_manually_verified;
            update.has_device_metrics = node_event->has_device_metrics;
            if (node_event->has_device_metrics)
            {
                update.device_metrics = node_event->device_metrics;
            }
            contact_service_.applyNodeUpdate(node_event->node_id, update);
            delete event;
            return true;
        }
        case sys::EventType::NodeProtocolUpdate:
        {
            auto* protocol_event = static_cast<sys::NodeProtocolUpdateEvent*>(event);
            contact_service_.updateNodeProtocol(protocol_event->node_id,
                                                protocol_event->protocol,
                                                protocol_event->timestamp);
            delete event;
            return true;
        }
        case sys::EventType::NodePositionUpdate:
        {
            auto* pos_event = static_cast<sys::NodePositionUpdateEvent*>(event);
            chat::contacts::NodePosition pos{};
            pos.valid = true;
            pos.latitude_i = pos_event->latitude_i;
            pos.longitude_i = pos_event->longitude_i;
            pos.has_altitude = pos_event->has_altitude;
            pos.altitude = pos_event->altitude;
            pos.timestamp = pos_event->timestamp;
            pos.precision_bits = pos_event->precision_bits;
            pos.pdop = pos_event->pdop;
            pos.hdop = pos_event->hdop;
            pos.vdop = pos_event->vdop;
            pos.gps_accuracy_mm = pos_event->gps_accuracy_mm;
            contact_service_.updateNodePosition(pos_event->node_id, pos);
            delete event;
            return true;
        }
        default:
            return false;
        }
    }

    bool initialized_ = false;
    bool team_mode_active_ = false;
    BoardBase* board_ = nullptr;
    LoraBoard* lora_board_ = nullptr;
    app::AppConfig config_{};
    IdfSdNodeBlobStore node_blob_store_{};
    IdfSdContactBlobStore contact_blob_store_{};
    chat::contacts::NodeStoreCore node_store_{node_blob_store_};
    chat::contacts::ContactStoreCore contact_store_{contact_blob_store_};
    chat::contacts::ContactService contact_service_{node_store_, contact_store_};
    chat::ChatModel chat_model_{};
    chat::RamStore chat_store_{};
    IdfNullMeshAdapter null_mesh_adapter_{};
    std::unique_ptr<platform::esp::radio::MeshtasticRadioAdapter> radio_mesh_adapter_{};
    chat::IMeshAdapter* mesh_adapter_ = &null_mesh_adapter_;
    std::unique_ptr<chat::ChatService> chat_service_{};
    std::unique_ptr<team::ITeamCrypto> team_crypto_{};
    std::unique_ptr<team::ITeamEventSink> team_event_sink_{};
    std::unique_ptr<team::TeamService::UnhandledAppDataObserver> team_app_data_bridge_{};
    std::unique_ptr<team::ITeamRuntime> team_runtime_{};
    std::unique_ptr<team::ITeamTrackSource> team_track_source_{};
    std::unique_ptr<team::TeamPairingService> team_pairing_service_{};
    std::unique_ptr<team::TeamService> team_service_{};
    std::unique_ptr<team::TeamController> team_controller_{};
    std::unique_ptr<team::TeamTrackSampler> team_track_sampler_{};
    chat::ui::IChatUiRuntime* chat_ui_runtime_ = nullptr;
    uint32_t last_node_store_flush_ms_ = 0;
};

IdfAppFacadeRuntime s_runtime{};
#endif

} // namespace

bool initialize(const platform::esp::boards::AppContextInitHandles& handles,
                const Esp32LvglRuntimeConfig& config)
{
#if defined(ESP_PLATFORM)
    if (!handles.isValid())
    {
        ESP_LOGE(config.log_tag, "IDF AppFacade runtime cannot start without board handles");
        return false;
    }

    if (app::hasAppFacade())
    {
        return true;
    }

    if (!s_runtime.begin(*handles.board, handles.lora_board))
    {
        ESP_LOGE(config.log_tag, "IDF AppFacade runtime initialization failed for %s", config.target_name);
        return false;
    }

    app::bindAppFacade(s_runtime);
    ESP_LOGI(config.log_tag,
             "IDF AppFacade runtime bound for %s self=%08lX mesh_backend=%s",
             config.target_name,
             static_cast<unsigned long>(s_runtime.getSelfNodeId()),
             s_runtime.getMeshAdapter() != nullptr && s_runtime.getMeshAdapter()->isReady()
                 ? "meshtastic_radio"
                 : "not_ready");
    return true;
#else
    (void)handles;
    (void)config;
    return false;
#endif
}

bool isInitialized()
{
#if defined(ESP_PLATFORM)
    return s_runtime.initialized();
#else
    return false;
#endif
}

} // namespace trailmate::apps::esp32_lvgl::idf_app_facade_runtime
